src/cf/DataProcessors/РаботаСРезультатамиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРезультатамиОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПрочитанныеДанныеСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрочитанныеДанныеСообщенийОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбъектаВИсточнике</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СодержимоеЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПространствоИменURI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛокальноеИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыОбновленияОбъектаПриПроблемахЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбновленияОбъектаПриПроблемахЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗагруженСозданНовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗагруженНеСоздан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженОбновлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗагруженНеОбновлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/РаботаСРезультатамиОбмена/Forms/ФормаПроблемыЗагруженныеСПроблемамиПриЗаписи/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьДанныеФормы();
	
	ОбработатьПереданныеПараметры(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеФормы();
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	РаботаСРезультатамиОбмена.ПриСохраненииДанныхОтображаемыхРеквизитовВНастройках(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСРезультатамиОбмена.УдалитьСохраняемуюНастройкуФорму(Настройки, "ОтображаемыеРеквизиты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ОтметитьПроблемуКакНеОбрабатываемуюПользователем();
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьПроблемуКакНеОбрабатываемуюПользователем()
	
	ДанныеЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
	ДанныеЗаписи.ПолученныйОбъект   = ПолученныйОбъект;
	ДанныеЗаписи.ПравилоКонвертации = ПравилоКонвертации;
	
	РегистрыСведений.ОбъектыКЗагрузке.ОтметитьПроблемуКакНеОбрабатываемуюПользователем(ДанныеЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияНавигационнойСсылки(Ключ, Представление, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НавигационнаяСсылка = НавигационнаяСсылкаФормы;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПереходВКомментарийОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВКомментарий" Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПерейтиВКомментарий(ЭтотОбъект, УзелИнформационнойБазы, ПолученныйОбъект, ОбъектФормата, ПравилоКонвертации, Комментарий);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусЗагрузкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСоответствиеВИБ" Тогда
		
		ОткрытьСопоставленныйОбъект();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РекомендацииПоРаботеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	
	СтандартнаяОбработка = Ложь;
	
	СсылкаСобытия = ДанныеСобытия.Href;
	
	Если СтрНайти(СсылкаСобытия, "ПерейтиНаСтраницуТекстОшибки") Тогда
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОсновное;
		Элементы.СтраницыПолученныйОбъектСравнение.ТекущаяСтраница = Элементы.СтраницаТекстОшибки;
		ТекущийЭлемент = Элементы.ТекстОшибки; 
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ОткрытьОбъектИБ") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьСоответствиеВИБ(СоответствиеВИБ, "РекомендацииПоРаботе");
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ОтклонитьЗагрузку") Тогда
		
		ВыполнитьКомандуПроблемаРешена();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтображаемыеРеквизитыПолученныйОбъект

&НаКлиенте
Процедура ОтображаемыеРеквизитыПолученныйОбъектВыбранПриИзменении(Элемент)
	
	ТекущийЭлементФормы = ТекущийЭлемент;
	Если ТекущийЭлементФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРезультатамиОбменаКлиент.ПриИзмененииВыбраноФормаТриЗначения(ЭтотОбъект, ТекущийЭлементФормы.Имя, "Выбран");
	
	РаботаСРезультатамиОбменаКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(
		Элементы.ОтчетПолученныйОбъект, "НЕАКТУАЛЬНОСТЬ");
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьОтчетПолученныеДанные(Команда)
	
	СформироватьОтчетПолученныеДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъектВИсточнике(Команда)
	
	Если ЗначениеЗаполнено(ВнешняяСсылкаНаОбъект) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ВнешняяСсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	ОткрытьСопоставленныйОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПолученныеДанные(Команда)
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуПолученныеДанные(ЭтотОбъект, ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы);
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ПриНачалеВыполненияКомандыЗагрузить(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИОткрыть(Команда)
	
	ПриНачалеВыполненияКомандыЗагрузить(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаги(Команда)
	
	ПриВыполненииКомандыИзменитьФлаги(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаги(Команда)
	
	ПриВыполненииКомандыИзменитьФлаги(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПроблему(Команда)
	
	ВыполнитьКомандуПроблемаРешена()
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

&НаСервере
Процедура ИнициализироватьДанныеФормы()
	
	РаботаСРезультатамиОбмена.ИнициализироватьДанныеФормыПроблемы(ЭтотОбъект, ""); 
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)
	
	Если Параметры.ДанныеЗаписиОбъектКЗагрузке = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'В форму не передана информация о проблеме.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	РаботаСРезультатамиОбмена.ЗаполнитьРеквизитыФормыПроблемыПоПараметрам(ЭтотОбъект); 
	
	РегистрыСведений.ОбъектыКЗагрузке.ОтметитьПроблемуКакОбрабатываемуюПользователем(Параметры.ДанныеЗаписиОбъектКЗагрузке);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления                КАК ДатаВозникновения,
	|	ОбъектыКЗагрузке.СсылкаНаОбъект                                КАК СсылкаНаОбъект,
	|	ОбъектыКЗагрузке.ВнешняяСсылкаНаОбъект                         КАК ВнешняяСсылкаНаОбъект,
	|	ОбъектыКЗагрузке.ПричинаДобавления                             КАК ПричинаДобавления,
	|	ОбъектыКЗагрузке.КомментарийАдминистратора                     КАК Комментарий,
	|	ПрочитанныеДанныеСообщенийОбмена.СодержимоеЗаписи              КАК СодержимоеЗаписи, 
	|	ПрочитанныеДанныеСообщенийОбмена.ДатаДобавления                КАК ДатаПолученияДанных,
	|	ОбъектыКЗагрузке.КраткоеПредставлениеОшибки                    КАК КраткоеПредставлениеОшибки,
	|	ОбъектыКЗагрузке.ОбъектМетаданных                              КАК ОбъектМетаданных,
	|	ОбъектыКЗагрузке.СтатусОбновленияОбъектаВИБ                    КАК СтатусОбновленияОбъектаВИБ,
	|	ОбъектыКЗагрузке.ДатаОбрабатываемойВерсии                      КАК ДатаОбрабатываемойВерсии,
	|	ОбъектыКЗагрузке.ПолноеПредставлениеОшибки                     КАК ПолноеПредставлениеОшибки
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|			И ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата   = ОбъектыКЗагрузке.ОбъектФормата
	|ГДЕ
	|	ОбъектыКЗагрузке.ПолученныйОбъект = &ПолученныйОбъект
	|	И ОбъектыКЗагрузке.ПравилоКонвертации = &ПравилоКонвертации
	|	И ОбъектыКЗагрузке.ОбъектФормата      = &ОбъектФормата
	|	И ОбъектыКЗагрузке.УзелПланаОбмена    = &УзелИнформационнойБазы";
	
	Запрос.УстановитьПараметр("ПолученныйОбъект",       ПолученныйОбъект);
	Запрос.УстановитьПараметр("ОбъектФормата",          ОбъектФормата);
	Запрос.УстановитьПараметр("ПравилоКонвертации",     ПравилоКонвертации);
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ВнешняяСсылкаНаОбъект          = Выборка.ВнешняяСсылкаНаОбъект;
	ПолноеПредставлениеОшибки      = Выборка.ПолноеПредставлениеОшибки;
	ВнешняяСсылкаНаОбъект          = Выборка.ВнешняяСсылкаНаОбъект;
	ДатаПолученияДанных            = Выборка.ДатаПолученияДанных;
	ДатаВозникновения              = Выборка.ДатаВозникновения;
	ДатаОбрабатываемойВерсии       = Выборка.ДатаОбрабатываемойВерсии;
	ПричинаДобавления              = Выборка.ПричинаДобавления;
	Комментарий                    = Выборка.Комментарий;
	ИдентификаторОбъектаМетаданных = Выборка.ОбъектМетаданных;
	ПредставлениеОбъектаМетаданных = Строка(Выборка.ОбъектМетаданных);
	СоответствиеВИБ                = Выборка.СсылкаНаОбъект;
	СтатусОбновленияОбъектаВИБ     = Выборка.СтатусОбновленияОбъектаВИБ;
	
	РаботаСРезультатамиОбмена.ЗаполнитьДанныеОбъектаМетаданныхВФормеПроблемы(ЭтотОбъект, Выборка.ОбъектМетаданных, Истина, Истина);
	
	ТекстОшибки = РаботаСРезультатамиОбмена.ФорматированныйДокументИзТекстаСоСсылками(ПолноеПредставлениеОшибки);
	
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьПереходВКомментарий(Элементы.ПереходВКомментарийДекорация, Комментарий, ЦветГиперссылки, КартинкаКомментарий);
	
	СформироватьПредставлениеСтатусЗагрузки();
	СформироватьОтчетПолученныеДанные();
	
	Заголовок = РаботаСРезультатамиОбмена.ЗаголовокФормыПроблемыОшибкиПриЗаписи(Выборка.ПричинаДобавления);
	
	ИмяМакетаРекомендации = РаботаСРезультатамиОбмена.ИмяМакетаРекомендацииФормаПроблемыОшибкаПриЗаписи(Выборка.ПричинаДобавления, Выборка.СтатусОбновленияОбъектаВИБ);
	
	РекомендацииПоРаботе = Обработки.РаботаСРезультатамиОбмена.ПолучитьМакет(ИмяМакетаРекомендации).ПолучитьТекст();
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты

&НаСервере
Процедура СформироватьОтчетПолученныеДанные()
	
	ДанныеПолученногоОбъекта = Новый Структура;
	ДанныеПолученногоОбъекта.Вставить("ПолученныйОбъект",   ПолученныйОбъект);
	ДанныеПолученногоОбъекта.Вставить("ПравилоКонвертации", ПравилоКонвертации);
	ДанныеПолученногоОбъекта.Вставить("ОбъектФормата",      ОбъектФормата);
	ДанныеПолученногоОбъекта.Вставить("УзелПланаОбмена",    УзелИнформационнойБазы);
	
	РезультатФормирования = Обработки.РаботаСРезультатамиОбмена.РезультатФормированияОтчетаДанныеОбъекта(ДанныеПолученногоОбъекта, ОтображаемыеРеквизиты); 
	
	Если РезультатФормирования.Успешно Тогда
		
		ОтчетПолученныйОбъект = РезультатФормирования.ТабличныйДокумент;
		РаботаСРезультатамиОбменаКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(
			Элементы.ОтчетПолученныйОбъект, "НЕИСПОЛЬЗОВАТЬ")
		
	Иначе
		
		РаботаСРезультатамиОбменаКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(
			Элементы.ОтчетПолученныйОбъект, "ОШИБКА", РезультатФормирования.ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыполненииКомандыИзменитьФлаги(Установить)
	
	РаботаСРезультатамиОбменаКлиент.ИзменитьЗначениеФлаговВДереве(ОтображаемыеРеквизиты, Установить);
	
	РаботаСРезультатамиОбменаКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(
		Элементы.ОтчетПолученныйОбъект, "НЕАКТУАЛЬНОСТЬ");
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеКомментария

&НаКлиенте
Процедура ПослеЗакрытияФормыКомментария(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Комментарий = Результат;
	
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьПереходВКомментарий(Элементы.ПереходВКомментарийДекорация, Комментарий, ЦветГиперссылки, КартинкаКомментарий);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	ИменаЭлементовПредставления = Новый Массив;
	ИменаЭлементовПредставления.Добавить("ОтображаемыеПоляПолученныйОбъект");
	
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьПредставлениеОтображаемыеПоля(Форма, ИменаЭлементовПредставления);
	
	Форма.Элементы.ФормаОткрытьОбъектВИсточнике.Видимость = Не ПустаяСтрока(Форма.ВнешняяСсылкаНаОбъект);
	Форма.Элементы.ФормаОткрытьОбъект.Видимость           = ЗначениеЗаполнено(Форма.СоответствиеВИБ);
	
КонецПроцедуры

#КонецОбласти

#Область СтатусЗагрузки

&НаСервере
Процедура СформироватьПредставлениеСтатусЗагрузки()

	СтатусЗагрузкиСтрока = ""; 
	
	Если СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженОбновлен Тогда
		
		СтатусЗагрузкиСтрока = СтроковыеФункции.ФорматированнаяСтрока("%1 <a href = %2>%3</a>", 
			НСтр("ru = 'Загружен, обновлен объект -'"),
			"ОткрытьСоответствиеВИБ",
			СоответствиеВИБ);
			
	ИначеЕсли СтатусОбновленияОбъектаВИБ = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый Тогда
		
		СтатусЗагрузкиСтрока = СтроковыеФункции.ФорматированнаяСтрока("%1 <a href = %2>%3</a>", 
			НСтр("ru = 'Загружен, создан новый -'"),
			"ОткрытьСоответствиеВИБ",
			СоответствиеВИБ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСопоставленныйОбъект()
	
	ПоказатьЗначение(, СоответствиеВИБ);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаОбъекта

&НаКлиенте
Процедура ПриНачалеВыполненияКомандыЗагрузить(ОткрытьПослеЗагрузки)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОткрытьОбъектПослеЗагрузки", ОткрытьПослеЗагрузки);
	
	ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеОтветаНаВопросЗагрузкиСОшибками", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопросаПриЗаписи, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросЗагрузкиСОшибками(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеДоступностью(ЭтотОбъект);
	
	ЗагрузитьОбъект(ДополнительныеПараметры.ОткрытьОбъектПослеЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбъект(ОткрытьОбъектПослеЗагрузки)
	
	ОчиститьСообщения();
	
	ДанныеОбъектаКОбработке = РаботаСРезультатамиОбменаКлиент.ДанныеПроблемыКОбработкеПоДаннымФормы(ЭтотОбъект);
	ДанныеОбъектаКОбработке.ИгнорироватьПроблемыПриЗаписи = Истина;
	
	РезультатЗагрузкиОбъекта = РезультатЗагрузкиОбъекта(ДанныеОбъектаКОбработке);
	
	Если Не РезультатЗагрузкиОбъекта.Успешно Тогда
		
		Для Каждого ТекстОшибки Из РезультатЗагрузкиОбъекта.Ошибки Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
		
		Возврат;
		
	Иначе
		
		НеобходимыеДействия = РаботаСРезультатамиОбменаКлиент.НеобходимыеДействияПослеЗагрузкиОбъекта(ЭтотОбъект, РезультатЗагрузкиОбъекта);
		
		Если НеобходимыеДействия.ТребуетсяВыборНовойПроблемы Тогда
			
			ДанныеВозврата = РаботаСРезультатамиОбменаКлиент.ДанныеЗакрытияФормыПроблемыПослеЗагрузки(
				ЭтотОбъект,
				НеобходимыеДействия,
				Ложь,
				РезультатЗагрузкиОбъекта);
			
			Закрыть(ДанныеВозврата);
			Возврат;
			
		ИначеЕсли НеобходимыеДействия.ОбъектЗагружен
			И ОткрытьОбъектПослеЗагрузки Тогда
			ТребуетсяОткрытиеОбъекта = Истина;
		Иначе
			ТребуетсяОткрытиеОбъекта = Ложь;
		КонецЕсли;
		
		Если НеобходимыеДействия.ТребуетсяОбновлениеЭтойФормы Тогда
			РаботаСРезультатамиОбменаКлиент.ПоказатьОповещениеПроблемаНеИзменилась();
			ЗаполнитьДанныеФормы();
		ИначеЕсли НеобходимыеДействия.ТребуетсяПовторноеОткрытиеФормыПроблемы
			Или ТребуетсяОткрытиеОбъекта
			Или НеобходимыеДействия.ВыполненаУстановкаСоответствия
			Или НеобходимыеДействия.ТребуетсяЗакрытиеИВыводПредупреждения Тогда
			
			ДанныеВозврата = РаботаСРезультатамиОбменаКлиент.ДанныеЗакрытияФормыПроблемыПослеЗагрузки(
				ЭтотОбъект,
				НеобходимыеДействия,
				ТребуетсяОткрытиеОбъекта,
				РезультатЗагрузкиОбъекта);
			
			Закрыть(ДанныеВозврата);
			
		Иначе
			
			Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатЗагрузкиОбъекта(ДанныеОбъектаКОбработке)
	
	Возврат РаботаСРезультатамиОбмена.РезультатЗагрузкиОбъектаИзФормыПроблемы(ДанныеОбъектаКОбработке);
	
КонецФункции

#КонецОбласти

#Область ПроблемаРешена

&НаКлиенте
Процедура ВыполнитьКомандуПроблемаРешена()
	
	ОчиститьСообщения();
	
	ДанныеОбъектаКОбработке = РаботаСРезультатамиОбменаКлиент.ДанныеПроблемыКОбработкеПоДаннымФормы(ЭтотОбъект);
	
	РезультатИзмененияПричины = РезультатУстановкиПричиныЗагрузкаОтклонена(ДанныеОбъектаКОбработке);
	
	Если Не РезультатИзмененияПричины.Успешно Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатИзмененияПричины.ТекстОшибки);
		
	Иначе
		
		Оповестить("Запись_ПричинаДобавленияОбъектыКЗагрузке");
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатУстановкиПричиныЗагрузкаОтклонена(ДанныеОбъектаКОбработке)
	
	Возврат РаботаСРезультатамиОбмена.РезультатУстановкиПричиныЗагрузкаОтклоненаВФормеПроблемы(ДанныеОбъектаКОбработке);
	
КонецФункции 

#КонецОбласти

#КонецОбласти
